Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/atdf/PIC32CZ8110CA90208S1.atdf
        <module name="PKRAM" id="DOS03785" name2="DOS03785" version="1a0">
          <instance name="PKRAM">
            <register-group name="PKRAM" name-in-module="PKRAM" address-space="base" offset="0x57000200"/>
          </instance>
        </module>
        <module name="RTC" version="1.0.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x59000000"/>
          </instance>
        </module>
        <module name="SYSREGS" version="1.0.0">
          <instance name="SYSREGS">
            <register-group name="SYSREGS" name-in-module="SYSREGS" address-space="base" offset="0x52001C00"/>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
        <module name="TAMPER" version="1.0.0">
          <instance name="TAMPER">
            <register-group name="TAMPER" name-in-module="TAMPER" address-space="base" offset="0x59000400"/>
          </instance>
        </module>
        <module name="TIMERS" version="1.0.0">
          <instance name="TIMERS">
            <register-group name="TIMERS" name-in-module="TIMERS" address-space="base" offset="0x52001800"/>
          </instance>
        </module>
        <module name="WDT" version="1.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x52000C00"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="CSM_COMMANDCANCEL" index="0" module-instance="CSM"/>
        <interrupt name="INTCTRL" index="1" module-instance="INTCTRL"/>
        <interrupt name="CSM_FCW" index="2" module-instance="CSM"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
    </device>
  </devices>
  <modules>
    <module name="AUXINTF" id="DOS03785" name2="DOS03785" version="1a0" caption="Auxiliary Interface">
      <register-group name="AUXINTF" caption="Auxiliary Interface">
        <register name="AIOFFSET" offset="0x0" rw="RW" size="4" atomic-op="set:AIOFFSET" initval="0x00000000" caption="Auxiliary Interface Address Offset">
          <bitfield name="OFFSET" caption="Address Offset" mask="0xFFFFFFFF"/>
        </register>
        <register name="AIATTR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Auxiliary Interface Attributes">
          <bitfield name="NSM" caption="Non Secure Master" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="CSM" id="DOS03785" name2="DOS03785" version="1a0" caption="Control and Status Module">
      <register-group name="CSM" caption="Control and Status Module">
        <register name="CSMCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000300" caption="CSM Control register A">
          <bitfield name="SECURED" caption="Secured bit" mask="0x4"/>
          <bitfield name="RTCCLK" caption="RTC Clock Enable bit" mask="0x8"/>
        </register>
        <register name="CSMCTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CSM Control register B">
          <bitfield name="ERROR" caption="Error Interrupt Request bit." mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt Request bit." mask="0x2"/>
        </register>
        <register name="CSMINTENCLR" offset="0x8" rw="R" size="4" atomic-op="clear:CSMINTENCLR" initval="0x00000000" caption="CSM INTERRUPT ENABLE Clear register">
          <bitfield name="CANCEL" caption="Cancel Command Interrupt Enable bit" mask="0x1"/>
        </register>
        <register name="CSMINTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:CSMINTENSET" initval="0x00000000" caption="CSM INTERRUPT ENABLE SET register">
          <bitfield name="CANCEL" caption="Cancel Command Interrupt Enable bit" mask="0x1"/>
        </register>
        <register name="CSMINTFLAG" offset="0x10" rw="R" size="4" atomic-op="clear:CSMINTFLAG" initval="0x00000000" caption="CSM INTERRUPT FLAG register">
          <bitfield name="CANCEL" caption="Cancel Command Interrupt Flag bit" mask="0x1"/>
        </register>
        <register name="CSMSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="CSM Status register">
          <bitfield name="OTPLOCK" caption="OTP Lock bit" mask="0x1"/>
        </register>
        <register name="CSMREPORT" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="CSM REPORT register">
          <bitfield name="BUSY" caption="HSM CPU Busy" mask="0x1"/>
          <bitfield name="PS" caption="Processing State bits" mask="0x70"/>
          <bitfield name="LCS" caption="Lifecycle State bits" mask="0x700"/>
          <bitfield name="SBS" caption="Secure Boot State bits" mask="0x7000"/>
          <bitfield name="ECODE" caption="Error Code" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
